#ifndef __VOFA_Protocol_H__
#define __VOFA_Protocol_H__
/* 包含头文件 ----------------------------------------------------------------*/
#include "stdint.h"
#include "string.h"

#ifdef _cplusplus
extern "C" {
#endif   
/* 宏定义 --------------------------------------------------------------------*/

/* 类型定义 ------------------------------------------------------------------*/

/* 扩展变量 ------------------------------------------------------------------*/
//DEBUG
extern float tempFloat[8];
/* 函数声明 ------------------------------------------------------------------*/
void VOFA_Write(float *qtempFloat,uint16_t len);
#ifdef _cplusplus
}
#endif   

#endif
